# BuiltInFailures.ToposolidBooleanPerturbationFailures Class

---
SystemObject Autodesk.Revit.DBBuiltInFailuresToposolidBooleanPerturbationFailures
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class ToposolidBooleanPerturbationFailures

    Public NotInheritable Class ToposolidBooleanPerturbationFailures

    public ref class ToposolidBooleanPerturbationFailures abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type ToposolidBooleanPerturbationFailures = class end
The BuiltInFailuresToposolidBooleanPerturbationFailures type exposes the following members.
| Name| Description
---|---|---
| NonPerturbationBooleanFailed|  Boolean operation failed without perturbation.
Top
#### Reference
Autodesk.Revit.DB Namespace